#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-EvFMHcteb4fU8rqN

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
aws_vpc.lab: Refreshing state... [id=vpc-00530d07d703d9ec1]
aws_subnet.lab-public-1: Refreshing state... [id=subnet-002e9d330eddeb30d]
aws_internet_gateway.lab: Refreshing state... [id=igw-0e4bacbc0b0cb4eba]
aws_lb_target_group.lab: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151]
aws_subnet.lab-public-0: Refreshing state... [id=subnet-0f938a911467c9bd1]
aws_security_group.lab: Refreshing state... [id=sg-027b22860f8854f56]
aws_subnet.lab-public-2: Refreshing state... [id=subnet-0d3391804baad62c3]
aws_route_table.lab: Refreshing state... [id=rtb-0bbb2096df58b721e]
aws_instance.EC2-1: Refreshing state... [id=i-06fcff76abdbd59a3]
aws_instance.EC2-0: Refreshing state... [id=i-04d3555dabb4dc8c5]
aws_instance.EC2-2: Refreshing state... [id=i-0f7c7a7cf21851f9e]
aws_route_table_association.public-access-0: Refreshing state... [id=rtbassoc-076271fc7007a2deb]
aws_route_table_association.public-access-2: Refreshing state... [id=rtbassoc-09809330a6e87afe5]
aws_route_table_association.public-access-1: Refreshing state... [id=rtbassoc-0a550610ceb14231a]
aws_lb_target_group_attachment.lab-1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414161036749500000005]
aws_lb_target_group_attachment.lab-0: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414161036624000000004]
aws_lb_target_group_attachment.lab-2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414161036959700000006]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.EC2-0 has changed
  ~ resource "aws_instance" "EC2-0" {
        id                                   = "i-04d3555dabb4dc8c5"
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-1 has changed
  ~ resource "aws_instance" "EC2-1" {
        id                                   = "i-06fcff76abdbd59a3"
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-2 has changed
  ~ resource "aws_instance" "EC2-2" {
        id                                   = "i-0f7c7a7cf21851f9e"
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2-0 must be replaced
-/+ resource "aws_instance" "EC2-0" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-04d3555dabb4dc8c5" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-04d3555dabb4dc8c5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05e6004dc54831b46" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-246.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.246" -> (known after apply)
      ~ public_dns                           = "ec2-35-175-242-89.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "35.175.242.89" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0b80ff781491a4c8c" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-1 must be replaced
-/+ resource "aws_instance" "EC2-1" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-06fcff76abdbd59a3" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-06fcff76abdbd59a3" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-03bd35c1984b88c38" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-148.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.148" -> (known after apply)
      ~ public_dns                           = "ec2-54-226-206-204.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.226.206.204" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-051143076272593a7" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-2 must be replaced
-/+ resource "aws_instance" "EC2-2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0f7c7a7cf21851f9e" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0f7c7a7cf21851f9e" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-02ebd8bd04e8a27f6" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-31.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.31" -> (known after apply)
      ~ public_dns                           = "ec2-54-211-42-233.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.211.42.233" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09397bb07aa7945b0" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lb.lab will be created
  + resource "aws_lb" "lab" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "development-load-balancer"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-027b22860f8854f56",
        ]
      + subnets                                     = [
          + "subnet-0f938a911467c9bd1",
        ]
      + tags                                        = {
          + "Environment" = "development"
        }
      + tags_all                                    = {
          + "Environment" = "development"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "test-lb"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.lab-0 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-0" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414161036624000000004" -> (known after apply)
      ~ target_id        = "i-04d3555dabb4dc8c5" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414161036749500000005" -> (known after apply)
      ~ target_id        = "i-06fcff76abdbd59a3" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-2 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-2" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414161036959700000006" -> (known after apply)
      ~ target_id        = "i-0f7c7a7cf21851f9e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket.lab will be created
  + resource "aws_s3_bucket" "lab" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-tf-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 6 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.lab,
│   on main.tf line 206, in resource "aws_s3_bucket" "lab":
│  206:   acl    = "private"
│ 
│ Use the aws_s3_bucket_acl resource instead
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*